public_html/app/Models/DbConnectionsModel.php

    public function getNIF($id_empresa)
    {
        return $this->where('id', $id_empresa)->first()['NIF'];
---
SELECT *
FROM `dbconnections`
WHERE `id` = '7'
 LIMIT 1