public_html/app/Models/Incidencias_model.php

    public function getIncidencias()
    {
        $data = datos_user();
        $new_db = db_connect($data['new_db']);

        $db = \Config\Database::connect($new_db);
        $builder = $db->table($this->table);

        $startDate = date('Y-m-d', strtotime('-7 days'));
        $endDate = date('Y-m-d');

        $builder->select('fichajes.id, fichajes.entrada, fichajes.incidencia, users.nombre_usuario');
        $builder->join('users', 'users.id = fichajes.id_usuario', 'inner');
        $builder->where('fichajes.incidencia !=', '');
        $builder->where('DATE(fichajes.entrada) >=', $startDate);
        $builder->where('DATE(fichajes.entrada) <=', $endDate);
        $builder->orderBy('fichajes.entrada', 'desc');

        $query = $builder->get();
---
SELECT `fichajes`.`id`, `fichajes`.`entrada`, `fichajes`.`incidencia`, `users`.`nombre_usuario`
FROM `fichajes`
INNER JOIN `users` ON `users`.`id` = `fichajes`.`id_usuario`
WHERE `fichajes`.`incidencia` != ''
AND DATE(fichajes.entrada) >= '2024-11-27'
AND DATE(fichajes.entrada) <= '2024-12-04'
ORDER BY `fichajes`.`entrada` DESC