public_html/app/Models/Pedidos_model.php

SELECT `pedidos`.*, `clientes`.`nombre_cliente`, `users`.`nombre_usuario`, `users`.`apellidos_usuario`
FROM `pedidos`
LEFT JOIN `clientes` ON `clientes`.`id_cliente` = `pedidos`.`id_cliente`
LEFT JOIN `users` ON `users`.`id` = `pedidos`.`id_usuario`
WHERE `pedidos`.`id_pedido` = '17156'
 LIMIT 1
---
    public function getPedidoWithRelations($coge_estado, $where_estado)
    {
    $builder = $this->select('pedidos.*, clientes.nombre_cliente, users.nombre_usuario, users.apellidos_usuario')
        ->join('clientes', 'clientes.id_cliente = pedidos.id_cliente', 'left')
        ->join('users', 'users.id = pedidos.id_usuario', 'left');

    if ($coge_estado === '' || $coge_estado === null) {
        // Condición compleja, pásala como string SQL
        $builder = $builder->where($where_estado);
    } else {
        // Condición simple, usa ambos parámetros
        $builder = $builder->where($coge_estado, $where_estado);
    }

    return $builder
        ->orderBy('pedidos.fecha_entrada', 'desc')
        ->orderBy('pedidos.id_pedido', 'desc')
        ->findAll();