public_html/app/Views/template/menu-navegacion.php

	function checkTime(i) {
	  if (i < 10) {i = "0" + i};  // add zero in front of numbers < 10
	  return i;
	}
	</script>
	<div id="txt"></div>
</div>
<div class="logo">
	<!-- Cargo FAVICON  -->
		<img src="<?php
		$session = session();
		$nif = $session->get('NIF');
		if ($nif !== null) {
			// Carga el modelo de la base de datos
			$db = \Config\Database::connect();
			// Realiza la consulta a la base de datos
			$query = $db->table('dbconnections')->getWhere(['NIF' => $nif]);
---
SELECT *
FROM `dbconnections`
WHERE `NIF` = '12884219'