public_html/app/Controllers/BaseController.php

SELECT *
FROM `menu`
ORDER BY `posicion` ASC
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);

        // Cargar helper de control de acceso
        helper('controlacceso');
        helper('url');
        // Ejecutar la lógica de control de acceso
        control_login();

        // Obtener los datos del usuario y almacenarlos en $data
        $this->data = datos_user();

        // Establecer la conexión a la base de datos especificada en $this->data['new_db']
        $this->db = db_connect($this->data['new_db']);

        // Crear una instancia del modelo de menú
        $menuModel = new MenuModel($this->db);
        // Crear una instancia del modelo de pedidos
        $this->pedidosModel = new Pedidos_model($this->db);

        // Obtener todos los elementos del menú desde la base de datos
        $menuItems = $menuModel->orderBy('posicion', 'asc')->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
        $session = session();
        $sessionData = $session->get('logged_in');

        $itemsUsuario = $datosUsuario->find($this->data['id_user']);