public_html/app/Controllers/BaseControllerGC.php

SELECT *
FROM `menu`
ORDER BY `posicion` ASC
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        parent::initController($request, $response, $logger);
        // Cargar helper de control de acceso
        helper('controlacceso');
        helper('url');
        // Ejecutar la lógica de control de acceso
        control_login();
        $this->nivel=control_login();
        //Cargo los archivos para que GroceryCRud no de error
        $this->output = (object)[
            'js_files' => [],
            'output' => ''
        ];
        // Obtener los datos del usuario y almacenarlos en $data
        $this->data = datos_user();
        // Establecer la conexión a la base de datos especificada en $this->data['new_db']
        $this->db = db_connect($this->data['new_db']);
        // Crear una instancia del modelo de menú
        $menuModel = new MenuModel($this->db);
        // Obtener todos los elementos del menú desde la base de datos
        $menuItems = $menuModel->orderBy('posicion', 'asc')->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
        $session = session();
        $sessionData = $session->get('logged_in');

        $itemsUsuario = $datosUsuario->find($this->data['id_user']);

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
protected function logAction($seccion, $log, $stateParameters) {
    // Crear una instancia del modelo Log y Usuarios2_Model
    $logModel = new \App\Models\Log_model($this->db);
    $datosUsuario = new Usuarios2_Model($this->db);

    // Intentar obtener los datos del usuario de la base de datos
    $itemsUsuario = $datosUsuario->find($this->data['id_user']);

INSERT INTO `log` (`fecha`, `id_usuario`, `log`, `seccion`) VALUES ('2024-09-06 08:58:27', 'Maria Sancho Prades', 'Actualización procesos para producto ID: 36', 'Productos/Procesos')
---
    ];

    // Insertar el registro de log en la base de datos
    $logModel->insert($data);