public_html/app/Controllers/BaseFichar.php

SELECT *
FROM `dbconnections`
WHERE `NIF` = '12884219'
 LIMIT 1
---
    protected function createDatabaseConnection($nif)
    {
        // Cargar el modelo
        $dbConnectionsModel = new \App\Models\DbConnections_Model();

        // Obtener la fila que coincide con el NIF proporcionado
        $dbConfigRow = $dbConnectionsModel->where('NIF', $nif)->first();