public_html/app/Controllers/ComparadorProductos.php

    public function index($id_producto = null)
    {
        $this->addBreadcrumb('Inicio', base_url('/'));
        $this->addBreadcrumb('Productos Necesidad', base_url('/productos_necesidad'));
        $this->addBreadcrumb('Comparador de Precios');

        $data = usuario_sesion();
        $db = db_connect($data['new_db']);

        $productosNecesidadModel = new ProductosNecesidadModel($db);
        $productosProveedorModel = new ProductosProveedorModel($db);

        $productos = $id_producto
            ? $productosNecesidadModel->where('id_producto', $id_producto)->findAll()
            : $productosNecesidadModel->orderBy('nombre_producto', 'ASC')->findAll();

        $comparador = [];
        foreach ($productos as $producto) {
            $ofertas = $productosProveedorModel
                ->select('productos_proveedor.*, proveedores.nombre_proveedor')
                ->join('proveedores', 'proveedores.id_proveedor = productos_proveedor.id_proveedor')
                ->where('id_producto_necesidad', $producto['id_producto'])
                ->findAll();
---
SELECT *
FROM `productos_necesidad`
WHERE `id_producto` = '17'
SELECT `productos_proveedor`.*, `proveedores`.`nombre_proveedor`
FROM `productos_proveedor`
JOIN `proveedores` ON `proveedores`.`id_proveedor` = `productos_proveedor`.`id_proveedor`
WHERE `id_producto_necesidad` = '17'