public_html/app/Controllers/Fichar.php

	public function CompruebaDia(){
		$aviso="";
		$hoy= date('Y-m-d');
		$dia= date('j');

		$datos = new Hoy($this->db);
		$diahoy= $datos->where('id',1)->findAll();
---
SELECT *
FROM `hoy`
WHERE `id` = 1