public_html/app/Controllers/Index.php

    public function pedidos_tabla($estado, $db)
    {
        // Control de login
        helper('controlacceso');

        // Saco los datos del usuario
        $data = datos_user();

        // Conecto la BDD
        $db = db_connect($data['new_db']);
        $lineapedidos = new Lineapedidosnew_model($db);
        try {
            $query = $lineapedidos
                ->where('estado', $estado)
                ->select('sum(total_linea) as total_euros')
                ->select('sum(n_piezas) as total_piezas')
                ->select('familia_productos.id_familia')  // table name in lowercase
                ->join('productos', 'linea_pedidos.id_producto = productos.id_producto')  // table name in lowercase
                ->join('familia_productos', 'productos.id_familia = familia_productos.id_familia')  // table name in lowercase
                ->select('familia_productos.nombre')  // table name in lowercase
                ->orderby("id_familia", "asc")
                ->groupby('id_familia')
                ->findAll();
---
SELECT sum(total_linea) as total_euros, sum(n_piezas) as total_piezas, `familia_productos`.`id_familia`, `familia_productos`.`nombre`
FROM `linea_pedidos`
JOIN `productos` ON `linea_pedidos`.`id_producto` = `productos`.`id_producto`
JOIN `familia_productos` ON `productos`.`id_familia` = `familia_productos`.`id_familia`
WHERE `estado` = 2
GROUP BY `id_familia`
ORDER BY `id_familia` ASC

    public function rutas_home($db)
    {
        $builder = new Rutas_model($db);
        try {
            $query = $builder
                ->where('rutas.estado_ruta <', '2')  // table name in lowercase
                ->join('poblaciones_rutas', 'poblaciones_rutas.id_poblacion = rutas.poblacion')  // table name in lowercase
                ->orderBy('poblacion', 'DESC')
                ->select('poblaciones_rutas.poblacion, rutas.recogida_entrega')  // table name in lowercase
                ->findAll();
---
SELECT `poblaciones_rutas`.`poblacion`, `rutas`.`recogida_entrega`
FROM `rutas`
JOIN `poblaciones_rutas` ON `poblaciones_rutas`.`id_poblacion` = `rutas`.`poblacion`
WHERE `rutas`.`estado_ruta` < '2'
ORDER BY `poblacion` DESC