public_html/app/Controllers/Partes_controller.php

        $builder = $db->table('linea_pedidos');
        $builder->select('*');
        $builder->where('id_lineapedido', $id_lineapedido);
        $query = $builder->get();
---
SELECT *
FROM `linea_pedidos`
WHERE `id_lineapedido` = '44051'

                        $builder = $db->table('pedidos');
                        $builder->select('*');
                        $builder->where('id_pedido', $elpedido);
                        $query2 = $builder->get();
---
SELECT *
FROM `pedidos`
WHERE `id_pedido` = '17156'

                            $builder = $db->table('clientes');
                            $builder->select('*');
                            $builder->where('id_cliente', $elcliente);
                            $query5 = $builder->get();
---
SELECT *
FROM `clientes`
WHERE `id_cliente` = '1703'

                        $builder = $db->table('productos');
                        $builder->select('*');
                        $builder->where('id_producto', $elproducto);
                        $query3 = $builder->get();
---
SELECT *
FROM `productos`
WHERE `id_producto` = '40'