public_html/app/Controllers/Pedidos_proveedor.php

SELECT `id_pedido`, `fecha_salida`, `id_proveedor`, `referencia`, `estado`, `fecha_entrega`, `id_usuario`, `total_pedido`
FROM `pedidos_proveedor`
ORDER BY `fecha_salida` DESC, `id_pedido` DESC
---
    public function todos()
    {
        // Agregar breadcrumbs para la página de todos los pedidos
        $this->addBreadcrumb('Inicio', base_url('/'));
        $this->addBreadcrumb('Pedidos');

        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $builder = $db->table('pedidos_proveedor');

        $builder->select('id_pedido, fecha_salida, id_proveedor, referencia, estado, fecha_entrega, id_usuario, total_pedido');
        $builder->orderBy('fecha_salida', 'desc');
        $builder->orderBy('id_pedido', 'desc');

        $pedidos = $builder->get()->getResultArray();

SELECT `nombre_proveedor`
FROM `proveedores`
WHERE `id_proveedor` = '12'
---
    private function getProveedorNombre($id_proveedor)
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $proveedor = $db->table('proveedores')->select('nombre_proveedor')->where('id_proveedor', $id_proveedor)->get()->getRow();

SELECT `nombre_usuario`
FROM `users`
WHERE `id` = '3'
---
    private function getUsuarioNombre($id_usuario)
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $usuario = $db->table('users')->select('nombre_usuario')->where('id', $id_usuario)->get()->getRow();

SELECT *
FROM `pedidos_proveedor`
WHERE `pedidos_proveedor`.`id_pedido` = '32'
SELECT `linea_pedido_proveedor`.*, `productos_proveedor`.`ref_producto`
FROM `linea_pedido_proveedor`
LEFT JOIN `productos_proveedor` ON `productos_proveedor`.`ref_producto` = `linea_pedido_proveedor`.`ref_producto`
WHERE `linea_pedido_proveedor`.`id_pedido` = '32'
---
    public function editar($id_pedido)
    {
        $this->addBreadcrumb('Inicio', base_url('/'));
        $this->addBreadcrumb('Pedidos', base_url('/pedidos_proveedor'));
        $this->addBreadcrumb('Editar Pedido');

        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $pedidoModel = new PedidosProveedorModel($db);
        $pedido = $pedidoModel->find($id_pedido);

        if (!$pedido) {
            return redirect()->to(base_url('pedidos_proveedor'))->with('error', 'Pedido no encontrado.');
        }

        $builder = $db->table('linea_pedido_proveedor');
        $builder->select('linea_pedido_proveedor.*, productos_proveedor.ref_producto');
        $builder->join('productos_proveedor', 'productos_proveedor.ref_producto = linea_pedido_proveedor.ref_producto', 'left');
        $builder->where('linea_pedido_proveedor.id_pedido', $id_pedido);

        // Obtener todas las líneas de pedido
        $lineasPedido = $builder->get()->getResultArray();

SELECT *
FROM `proveedores`
---
        // Convertir el array asociativo en un array simple
        $lineasPedido = array_values($lineasUnicas);

        $proveedores = (new ProveedoresModel($db))->findAll();

SELECT `id`, `nombre_usuario`
FROM `users`
---
    private function getUsuarios()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        return $db->table('users')->select('id, nombre_usuario')->get()->getResultArray();

SELECT *
FROM `proveedores`
---
    public function addPedido()
    {
        $this->addBreadcrumb('Inicio', base_url('/'));
        $this->addBreadcrumb('Pedidos Proveedor', base_url('pedidos_proveedor'));
        $this->addBreadcrumb('Añadir Pedido');

        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $clienteModel = new ProveedoresModel($db);

        $data['proveedores'] = $clienteModel->findAll();

INSERT INTO `pedidos_proveedor` (`id_proveedor`, `referencia`, `fecha_salida`, `observaciones`, `id_usuario`) VALUES ('14', '', '2024-12-04', '', '3')
---
    public function save()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $pedidoModel = new PedidosProveedorModel($db);
        log_message('debug', 'Datos recibidos en el método save: ' . print_r($this->request->getPost(), true));
        $pedidoData = [
            'id_proveedor' => $this->request->getPost('id_proveedor'),
            'referencia' => $this->request->getPost('referencia'),
            'fecha_salida' => $this->request->getPost('fecha_salida'),
            'observaciones' => $this->request->getPost('observaciones'),
            'id_usuario' => $data['id_user']
        ];
        if ($pedidoModel->insert($pedidoData)) {

SELECT `ref_producto`, `precio`
FROM `productos_proveedor`
WHERE `id` = '54'
---
    private function crearLineaAutomatica($idPedido, $idProductoProveedor)
    {

        $data = usuario_sesion();
        $db = db_connect($data['new_db']);

        $builder = $db->table('productos_proveedor');
        $builder->select('ref_producto, precio');
        $builder->where('id', $idProductoProveedor);
        $producto = $builder->get()->getRow();

SELECT `id`, `nombre_usuario`, `apellidos_usuario`
FROM `users`
WHERE `id` = '3'
AND `user_activo` = '1'
---
    function guarda_usuario()
    {
        $datos = new \App\Models\Usuarios2_Model();
        $data = usuario_sesion();
        $id_empresa = $data['id_empresa'];
        $id_usuario = $data['id_user'];
        $array = ['nivel_acceso' => '1', 'id_empresa' => $id_empresa];
        $usuarios = $datos->where($array)->findAll();
        $user_ids = array();
        foreach ($usuarios as $usuario) {
            $user_ids[] = $usuario['id'];
        }
        $db_cliente = db_connect($data['new_db']);
        $builder = $db_cliente->table('users');
        $builder->select('id, nombre_usuario, apellidos_usuario');
        $builder->where('id', $id_usuario);
        $builder->where('user_activo', '1');
        $query = $builder->get();

SELECT `id_proveedor`
FROM `pedidos_proveedor`
WHERE `id_pedido` = '32'
SELECT `ref_producto`, `id`
FROM `productos_proveedor`
WHERE `id_proveedor` = '12'
---
    public function addLineaPedidoForm($id_pedido)
    {
        $db = db_connect(usuario_sesion()['new_db']);

        // Obtener el id_proveedor del pedido
        $pedidoBuilder = $db->table('pedidos_proveedor');
        $pedido = $pedidoBuilder->select('id_proveedor')->where('id_pedido', $id_pedido)->get()->getRow();

        if (!$pedido) {
            return redirect()->back()->with('error', 'Pedido no encontrado.');
        }

        // Filtrar productos que pertenecen al proveedor
        $productosBuilder = $db->table('productos_proveedor');
        $productosBuilder->select('ref_producto, id');
        $productosBuilder->where('id_proveedor', $pedido->id_proveedor);
        $productos = $productosBuilder->get()->getResultArray();

SELECT SUM(`total_linea`) AS `total_linea`
FROM `linea_pedido_proveedor`
WHERE `id_pedido` = 31
SELECT COUNT(*) AS `numrows`
FROM `linea_pedido_proveedor`
WHERE `id_pedido` = 31
---
    private function actualizarTotalPedido($idPedido)
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);

        // Obtener el total de las líneas asociadas al pedido
        $builder = $db->table('linea_pedido_proveedor');
        $builder->selectSum('total_linea');
        $builder->where('id_pedido', $idPedido);
        $total = $builder->get()->getRow()->total_linea;

        // Validar si hay líneas de pedido
        $builder->resetQuery();
        $builder->select('id_lineapedido');
        $builder->where('id_pedido', $idPedido);
        $hasLines = $builder->countAllResults();