public_html/app/Controllers/Pedidos.php

SELECT `linea_pedidos`.*, `productos`.`nombre_producto`
FROM `linea_pedidos`
JOIN `productos` ON `productos`.`id_producto` = `linea_pedidos`.`id_producto`
WHERE `linea_pedidos`.`id_pedido` = '17156'
SELECT *
FROM `productos`
SELECT *
FROM `users`
SELECT *
FROM `clientes`
SELECT *
FROM `estados`
---
	public function edit($id_pedido)
	{
		$this->addBreadcrumb('Inicio', base_url('/'));
        $this->addBreadcrumb('Pedidos', base_url('/pedidos/enmarcha'));
        $this->addBreadcrumb('Editar Pedido');
		helper('controlacceso');
		$session = session();
		$data = datos_user();
		$db = db_connect($data['new_db']);
		$pedidoModel = new Pedidos_model($db);
		$clienteModel = new ClienteModel($db);
		$estadoModel = new EstadoModel($db);
		$productosModel = new Productos_model($db);
		$usuarioModel = new Usuarios2_Model($db);
		// Obtener el pedido actual a editar
		$pedido = $pedidoModel->findPedidoWithUser($id_pedido);
		if (!$pedido) {
			return redirect()->back()->with('error', 'Pedido no encontrado');
		}
		// Obtener las líneas de pedido con el nombre del producto
		$builder = $db->table('linea_pedidos');
		$builder->select('linea_pedidos.*, productos.nombre_producto');
		$builder->join('productos', 'productos.id_producto = linea_pedidos.id_producto');
		$builder->where('linea_pedidos.id_pedido', $id_pedido);
		$query = $builder->get();
		$lineas_pedido = $query->getResultArray();

		// Pasar los datos a la vista
		$data['productos'] = $productosModel->findAll();
		$data['users'] = $usuarioModel->findAll();
		$data['clientes'] = $clienteModel->findAll();
		$data['estados'] = array_filter($estadoModel->findAll(), function ($estado) {
			return $estado['id_estado'] != 3; // Filtra el estado con id 3
		});