public_html/app/Controllers/Procesos_pedidos.php

    public function index() {
        $data = datos_user();
        $db = db_connect($data['new_db']);
        $lineaPedidoModel = new LineaPedido($db);
        $pedidoModel = new Pedido($db);
        $productoModel = new Producto($db);
        $clienteModel = new Cliente($db);
        $procesoProducto = new ProcesoProducto($db);
        $procesoModel = new Proceso($db);
        $maquinasModel = new Maquinas($db);
        $procesosPedidoModel = new ProcesosPedido($db);

        $lineasConEstado2 = $this->obtenerLineasPedidoConEstado2YCrearProcesos();

        // Obtener líneas de pedido con estado = 2
        $lineas = $lineaPedidoModel->whereIn('estado', [2, 3])->findAll();

        // Obtener procesos_pedido con estado = 2
        $procesosPedido = $procesosPedidoModel->where('estado', 2)->findAll();

        $data = [];

        foreach ($lineas as $linea) {
            foreach ($procesosPedido as $procesoPedido) {
                if ($linea['id_lineapedido'] == $procesoPedido['id_linea_pedido']) {

                    $pedido = $pedidoModel->find($linea['id_pedido']);
                    $cliente = $clienteModel->find($pedido['id_cliente']);
                    $producto = $productoModel->find($linea['id_producto']);
                    $proceso = $procesoModel->find($procesoPedido['id_proceso']);
---
SELECT *
FROM `linea_pedidos`
WHERE `estado` IN (2,3)
SELECT *
FROM `procesos_pedidos`
WHERE `estado` = 2
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id_pedido` = '31'
SELECT *
FROM `clientes`
WHERE `clientes`.`id_cliente` = '5'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '4'
SELECT *
FROM `procesos`
WHERE `procesos`.`id_proceso` = '1'

        }

        // Obtener líneas con estado = 3 y ordenar por el campo 'id_maquina'
        $lineasEstado3 = $procesosPedidoModel->where('estado', 3)->orderBy('id_maquina', 'ASC')->orderBy('orden', 'ASC')->findAll();
        $dataEstado3 = [];

        foreach ($lineasEstado3 as $lineaEstado3) {
            $lineaPedido = $lineaPedidoModel->find($lineaEstado3['id_linea_pedido']);
            $pedido = $pedidoModel->find($lineaPedido['id_pedido']);
            $cliente = $clienteModel->find($pedido['id_cliente']);
            $producto = $productoModel->find($lineaPedido['id_producto']);
            $proceso = $procesoModel->find($lineaEstado3['id_proceso']);
---
SELECT *
FROM `procesos_pedidos`
WHERE `estado` = 3
ORDER BY `id_maquina` ASC, `orden` ASC
SELECT *
FROM `linea_pedidos`
WHERE `linea_pedidos`.`id_lineapedido` = '70'
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id_pedido` = '31'
SELECT *
FROM `clientes`
WHERE `clientes`.`id_cliente` = '5'
SELECT *
FROM `productos`
WHERE `productos`.`id_producto` = '4'
SELECT *
FROM `procesos`
WHERE `procesos`.`id_proceso` = '1'

        }

        // Obtener todas las máquinas
        $maquinas = $maquinasModel->findAll();
        $procesos = $procesoModel->findAll();
        $clientes = $clienteModel->findAll();
---
SELECT *
FROM `maquinas`
SELECT *
FROM `procesos`
SELECT *
FROM `clientes`

public function revertirEstadoProcesos() {
    $data = usuario_sesion();
    $db = db_connect($data['new_db']);
    $procesosPedidoModel = new ProcesosPedido($db);
    $procesoModel = new Proceso($db);
    $lineaPedidoModel = new LineaPedido($db);
    $pedidoModel = new Pedido($db);

    $data = $this->request->getJSON(true);

    if (!isset($data['procesos']) || !is_array($data['procesos'])) {
        return $this->response->setJSON(['error' => 'Datos inválidos']);
    }

    $idsPedidoActualizados = [];
    $idsMaquinaAfectadas = []; // Nuevo array para almacenar los IDs de máquinas afectadas

    foreach ($data['procesos'] as $proceso) {
        if (isset($proceso['nombre_proceso']) && isset($proceso['id_linea_pedido'])) {
            $procesoEncontrado = $procesoModel->where('nombre_proceso', $proceso['nombre_proceso'])->first();

            if ($procesoEncontrado) {
                $idProceso = $procesoEncontrado['id_proceso'];

                // Antes de actualizar, obtener el id_maquina actual para reordenamiento posterior
                $procesoActual = $procesosPedidoModel
                    ->where('id_proceso', $idProceso)
                    ->where('id_linea_pedido', $proceso['id_linea_pedido'])
                    ->first();
---
SELECT *
FROM `procesos`
WHERE `nombre_proceso` = 'CORTE DE TIRAS'
 LIMIT 1
SELECT *
FROM `procesos_pedidos`
WHERE `id_proceso` = '1'
AND `id_linea_pedido` = '70'
 LIMIT 1

                    $idsMaquinaAfectadas[$procesoActual['id_maquina']] = true;
                }

                $procesosPedidoModel
                    ->where('id_proceso', $idProceso)
                    ->where('id_linea_pedido', $proceso['id_linea_pedido'])
                    ->set(['estado' => 2, 'id_maquina' => null, 'orden'=>0])
                    ->update();

                $lineaPedido = $lineaPedidoModel->where('id_lineapedido', $proceso['id_linea_pedido'])->first();
                if ($lineaPedido && $lineaPedido['estado'] != 2) {
                    $lineaPedidoModel
                        ->where('id_lineapedido', $proceso['id_linea_pedido'])
                        ->set(['estado' => 2])
                        ->update();
---
UPDATE `procesos_pedidos` SET `estado` = 2, `id_maquina` = NULL, `orden` = 0
WHERE `id_proceso` = '1'
AND `id_linea_pedido` = '70'
SELECT *
FROM `linea_pedidos`
WHERE `id_lineapedido` = '70'
 LIMIT 1
UPDATE `linea_pedidos` SET `estado` = 2
WHERE `id_lineapedido` = '70'


    // Actualizar el estado de los pedidos afectados
    foreach (array_keys($idsPedidoActualizados) as $idPedido) {
        $pedidoModel
            ->where('id_pedido', $idPedido)
            ->set(['estado' => 2])
            ->update();
---
UPDATE `pedidos` SET `estado` = 2
WHERE `id_pedido` = 31

public function obtenerLineasPedidoConEstado2YCrearProcesos() {
    $data = datos_user();
    $db = db_connect($data['new_db']);
    $lineaPedidoModel = new LineaPedido($db);
    $procesosPedidoModel = new ProcesosPedido($db);
    $procesosProductosModel = new ProcesosProductos($db);

    //Añadir que filtre por id_lineapedido
    $lineasConEstado2 = $lineaPedidoModel->where('estado', 2)->findAll();

    foreach ($lineasConEstado2 as $linea) {
        $idProducto = $linea['id_producto'];
        $procesosProductos = $procesosProductosModel->where('id_producto', $idProducto)->findAll();

        foreach ($procesosProductos as $procesoProducto) {
            // Comprobar si ya existe una línea con este id_proceso y id_linea_pedido
            $existe = $procesosPedidoModel->where([
                'id_proceso' => $procesoProducto['id_proceso'],
                'id_linea_pedido' => $linea['id_lineapedido']
            ])->first();
---
SELECT *
FROM `linea_pedidos`
WHERE `estado` = 2
SELECT *
FROM `procesos_productos`
WHERE `id_producto` = '4'
SELECT *
FROM `procesos_pedidos`
WHERE `id_proceso` = '1'
AND `id_linea_pedido` = '71'
 LIMIT 1