public_html/app/Controllers/Procesos_pedidos.php

    public function obtenerLineasPedidoConEstado2YCrearProcesos()
    {
        $data = datos_user();
        $db = db_connect($data['new_db']);
        $lineaPedidoModel = new LineaPedido($db);
        $procesosPedidoModel = new ProcesosPedido($db);
        $procesosProductosModel = new ProcesosProductos($db);

        // Obtener líneas de pedido con estado = 2
        $lineasConEstado2 = $lineaPedidoModel->where('estado', 2)->findAll();

        foreach ($lineasConEstado2 as $linea) {
            $idProducto = $linea['id_producto'];

            // Obtener todos los procesos asociados a este producto
            $procesosProductos = $procesosProductosModel->where('id_producto', $idProducto)->findAll();

            foreach ($procesosProductos as $procesoProducto) {
                // Comprobar si ya existe una línea con este id_proceso y id_linea_pedido
                $existe = $procesosPedidoModel->where([
                    'id_proceso' => $procesoProducto['id_proceso'],
                    'id_linea_pedido' => $linea['id_lineapedido']
                ])->first();
---
SELECT *
FROM `linea_pedidos`
WHERE `estado` = 2
SELECT *
FROM `procesos_productos`
WHERE `id_producto` = '133'
SELECT *
FROM `procesos_pedidos`
WHERE `id_proceso` = '3'
AND `id_linea_pedido` = '42886'
 LIMIT 1