public_html/app/Controllers/Procesos.php

    public function index()
    {
        $this->addBreadcrumb('Inicio', base_url('/'));
        $this->addBreadcrumb('Procesos');

        $data = datos_user();
        $db = db_connect($data['new_db']);
        $procesoModel = new Proceso($db);
        $procesos = $procesoModel->where('estado_proceso', 1)->orderBy('nombre_proceso', 'ASC')->findAll();
---
SELECT *
FROM `procesos`
WHERE `estado_proceso` = 1
ORDER BY `nombre_proceso` ASC