public_html/app/Controllers/Productos_necesidad.php

    public function getProductos()
    {
        $data = usuario_sesion();
        $db = db_connect($data['new_db']);
        $productosModel = new ProductosNecesidadModel($db);
        $productosProveedorModel = new \App\Models\ProductosProveedorModel($db);
        $productosVentaModel = new \App\Models\Productos_model($db);

        $productos = $productosModel->findAll();
        foreach ($productos as &$producto) {
            // Obtener la familia
            $familia = (new FamiliaProveedorModel($db))->find($producto['id_familia']);
            $producto['nombre_familia'] = $familia ? $familia['nombre'] : 'Sin familia';

            // Imagen
            $producto['imagen'] = $this->getImageUrl($producto['imagen'], $data['id_empresa'], $producto['id_producto']);

            // Acciones
            $producto['acciones'] = [
                'precio' => base_url("comparadorproductos/{$producto['id_producto']}"),
                'verProductos' => base_url("productos_necesidad/verProductos/{$producto['id_producto']}"),
                'editar' => base_url("productos_necesidad/edit/{$producto['id_producto']}"),
                'eliminar' => base_url("productos_necesidad/delete/{$producto['id_producto']}")
            ];

            // Precio de compra y nombre del proveedor
            if (!empty($producto['mejor'])) {
                $precioProveedor = $productosProveedorModel
                    ->where('id_producto_necesidad', $producto['id_producto'])
                    ->where('id', $producto['mejor'])
                    ->select('precio, id_proveedor')
                    ->get()
                    ->getRow();
---
SELECT *
FROM `productos_necesidad`
SELECT *
FROM `familia_proveedor`
WHERE `familia_proveedor`.`id_familia` = '8'
SELECT `precio`, `id_proveedor`
FROM `productos_proveedor`
WHERE `id_producto_necesidad` = '17'
AND `id` = '54'

            if ($precioProveedor) {
                $producto['precio'] = $precioProveedor->precio;
                // Obtener el nombre del proveedor
                $proveedor = (new \App\Models\ProveedoresModel($db))->find($precioProveedor->id_proveedor);
---
SELECT *
FROM `proveedores`
WHERE `proveedores`.`id_proveedor` = '14'