public_html/app/Controllers/Productos.php

SELECT *
FROM `procesos_productos`
LEFT JOIN `procesos` ON `procesos`.`id_proceso` = `procesos_productos`.`id_proceso`
WHERE `id_producto` = '4'
ORDER BY `nombre_proceso` ASC
SELECT *
FROM `productos`
WHERE `id_producto` = '4'
SELECT *
FROM `procesos`
---
    public function show($id)
    {
        helper('controlacceso');
        $data = usuario_sesion();
        $dbClient = db_connect($data['new_db']);

        $query = $dbClient->table('productos')->getWhere(['id_producto' => $id]);
        $producto = $query->getRow();

        $query = $dbClient->table('procesos')->get();
        $allProcesses = $query->getResult();

        $builder = $dbClient->table('procesos_productos');
        $builder->select('procesos_productos.*, procesos.nombre_proceso');
        $builder->where(['id_producto' => $id]);
        $builder->join('procesos', 'procesos.id_proceso=procesos_productos.id_proceso', 'left');
        $builder->orderby('orden', 'asc');
        $query = $builder->get();

        $orderedProcesses = $query->getResult();

DELETE FROM `procesos_productos`
WHERE `id_producto` = '36'
SELECT *
FROM `procesos`
WHERE `id_proceso` = 5
---
    public function updateOrder()
    {
        helper('controlacceso');
        $data = usuario_sesion();
        $dbClient = db_connect($data['new_db']);
        $postData = $this->request->getPost();

        if (!isset($postData['data']) || !is_string($postData['data'])) {
            return $this->response->setStatusCode(400, 'Bad Request: Missing or invalid data parameter');
        }

        $newOrder = json_decode($postData['data'], true);
        $id_producto = $newOrder[0]['id_producto'];
        $dbClient->table('procesos_productos')->where('id_producto', $id_producto)->delete();

        $procesosAnteriores = [];

        foreach ($newOrder as $item) {
            $id_proceso = $item['id_proceso'];
            $orden = $item['orden'];

            // Verificar si el proceso tiene restricción
            $proceso = $dbClient->table('procesos')->where('id_proceso', $id_proceso)->get()->getRow();

INSERT INTO `procesos_productos` (`id_producto`, `id_proceso`, `orden`, `restriccion`) VALUES ('36', 5, 1, '')
---
            }

            // Insertar el proceso en la tabla procesos_productos
            $dbClient->table('procesos_productos')->insert([
                'id_producto' => $id_producto,
                'id_proceso' => $id_proceso,
                'orden' => $orden,
                'restriccion' => $restricciones
            ]);