public_html/app/Controllers/Productos.php

SELECT `id_proceso`
FROM `procesos_productos`
WHERE `id_producto` = '36'
---
    public function show($id)
    {
        helper('controlacceso');
        $data = usuario_sesion();
        $dbClient = db_connect($data['new_db']);

        $query = $dbClient->table('productos')->getWhere(['id_producto' => $id]);
        $producto = $query->getRow();

        $query = $dbClient->table('procesos')->get();
        $allProcesses = $query->getResult();

        $builder = $dbClient->table('procesos_productos');
        $builder->select('procesos_productos.*, procesos.nombre_proceso');
        $builder->where(['id_producto' => $id]);
        $builder->join('procesos', 'procesos.id_proceso=procesos_productos.id_proceso', 'left');
        $builder->orderby('orden', 'asc');
        $query = $builder->get();