public_html/app/Controllers/Rutas_transporte.php

SELECT *
FROM `users`
WHERE `id` = '12'
---
    public function edit()
    {
        $session = session();
        $sessionData = $session->get('logged_in');
        $userId = $sessionData['id_user'];
        $db = db_connect();

        $query = $db->table('users')->where('id', $userId)->get();
        $user = $query->getRow();

        $data = datos_user();
        $database = $data['new_db'];
        $dbClient = db_connect($database);

        $queryClient = $dbClient->table('users')->where('id', $userId)->get();