public_html/app/Controllers/Verifylogin.php

    public function index()
    {
        helper(['url', 'form', 'controlacceso']);

        if ($this->request->getPost('username')) {
            $db = \Config\Database::connect();
            $builder = $db->table('users');
            $builder->select('*');
            $builder->where('username', $this->request->getPost('username'));
            $builder->limit(1);
            $query = $builder->get();
---
SELECT *
FROM `users`
WHERE `username` = 'msancho'
 LIMIT 1